r1 = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
r0 = ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
r2 = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
r3 = ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
n = int(input())
s = ""
while not 0 < n < 1000:
	n = int(input())
if n // 100 > 0:
	s += r3[n//100-1]+" "
	n = n%100
if n // 10 > 0:
	if n // 10 == 1:
		s += r0[n-11]
		n = 0
	else:
		s += r2[n//10-1]+" "
		n = n%10
if n != 0:
	s += r1[n]
print(s)
