a = ["Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое", "Двадцать", "Тридцатое", "Тридцать первое"]
n = int(input("Введите номер дня: "))
m = int(input("Введите номер месяца: "))-1
b = ["Января", "Февраля", "Марта", "Апреля", "Мая", "Июня", "Июля", "Августа", "Сентября", "Октября", "Ноября", "Декабря"]
s = ""
if n < 21:
	s += a[n-1]+" "
elif n < 30:
	s += a[20]+" "+a[n-21]
elif n == 30:
	s += a[21]+" "
else:
	s += a[22]+" "
s += b[m]
print(s)
